What are different Data Structures in Python?
1. List
2. Set
3. Tuple
4. Dictionary

What is a sequence?
Sequnece is generic term for any ordered set

includes List, Tuples and Strings

What is a Data Structure?

Data Structures are different ways of Organizing and storing data and then efficiently retrieving it

###### List

1. It is a collection, which is ordered and changable
2. Can have Duplicate values
3. Data Type can be different
4. Can be written as comma separted values within square brackets

#### Common List Methods and Description
    Method	      Description
    append()	Adds an element at the end of the list
    clear()	    Removes all the elements from the list
    copy()	    Returns a copy of the list
    count()	    Returns the number of elements with the specified value
    extend()	Add the elements of a list (or any iterable), to the end of the current list
    index()	    Returns the index of the first element with the specified value
    insert()	Adds an element at the specified position
    pop()	    Removes the element at the specified position
    remove()	Removes the first item with the specified value
    reverse()	Reverses the order of the list
    sort()	    Sorts the list

In [56]:
# example of List containing City name
# Creating a List
city_names =['New York', 'Chicago', 'California', 'Denver', 'Seattel']
print(city_names)

['New York', 'Chicago', 'California', 'Denver', 'Seattel']

In [57]:
# Add an item to List
city_names.append('Dallas')
print(city_names)

['New York', 'Chicago', 'California', 'Denver', 'Seattel', 'Dallas']

In [58]:
# Adding a duplicate value
city_names.append('Chicago')
print(city_names)

['New York', 'Chicago', 'California', 'Denver', 'Seattel', 'Dallas', 'Chicago']

In [59]:
# different Data Type
city_names.append(100)
print(city_names)

['New York', 'Chicago', 'California', 'Denver', 'Seattel', 'Dallas', 'Chicago', 100]

In [60]:
# deleting the value from list
city_names.remove(100)
print(city_names)

['New York', 'Chicago', 'California', 'Denver', 'Seattel', 'Dallas', 'Chicago']

In [61]:
# accessing List values
# accessing the third element from city_names
print(city_names[2])

California

In [51]:
# fidning length of the list city_names
print(len(city_names))

7

In [62]:
#iterating thru the list
for i in range(len(city_names)):
    print(i, " ", city_names[i])

0   New York
1   Chicago
2   California
3   Denver
4   Seattel
5   Dallas
6   Chicago

In [63]:
# efficient list comprehension
print( [city_names[x] for x in range(len(city_names)) ])

['New York', 'Chicago', 'California', 'Denver', 'Seattel', 'Dallas', 'Chicago']

In [64]:
#counting no. of instances for Dallas
# Add an item to List
city_names.append('Dallas')
print(city_names)
print(city_names.count('Dallas'))

['New York', 'Chicago', 'California', 'Denver', 'Seattel', 'Dallas', 'Chicago', 'Dallas']
2

In [65]:
#reversing elements of a List
city_names.reverse()
print(city_names)

['Dallas', 'Chicago', 'Dallas', 'Seattel', 'Denver', 'California', 'Chicago', 'New York']

In [66]:
# sorts the list 
city_names.sort()
print(city_names)

['California', 'Chicago', 'Chicago', 'Dallas', 'Dallas', 'Denver', 'New York', 'Seattel']

###### Set
1. Is a collection that is unordered and unindexed
2. can be changed
3. cannot have duplicates
4. useful to hold Unique values
5. supports mathematical operations like union, intersection, symmetry, difference
6. { } are used to create sets

In [67]:
# creating a set - only Unique values will exists
cities ={'Tokyo', 'Fankfurt','Mumbai', 'New York', 'Chicago', 'Tokyo', 'Mumbai'}
print(cities)

{'Fankfurt', 'Tokyo', 'New York', 'Mumbai', 'Chicago'}

In [68]:
#checking if Mumbai is in the set
'Mumbai' in cities

True

In [69]:
'SFO'  in cities

False

In [71]:
# difference between cities, which is a set and city_names, which is a List
# since city_names is a List, casting it to a set and then taking a difference
print(cities - set(city_names))

{'Mumbai', 'Fankfurt', 'Tokyo'}

In [73]:
# Union between cities, which is a set and city_names, which is a List
# since city_names is a List, casting it to a set and then taking a Union
print(cities | set(city_names))

{'Seattel', 'Fankfurt', 'Tokyo', 'New York', 'California', 'Dallas', 'Denver', 'Mumbai', 'Chicago'}

In [74]:
# Common between cities, which is a set and city_names, which is a List
# since city_names is a List, casting it to a set and then taking a intersection
print(cities & set(city_names))

{'New York', 'Chicago'}

In [75]:
# Unique values but present in both between cities, which is a set and city_names, which is a List
# since city_names is a List, casting it to a set 
print(cities ^ set(city_names))

{'Seattel', 'Fankfurt', 'California', 'Dallas', 'Denver', 'Mumbai', 'Tokyo'}

In [77]:
# sets can also be created by using set()
cities_in_usa =set(('San Francisco', 'Los Angeles', 'New York','Chicago','Omaha', 'Little Rock', 'Dallas'))
print(cities_in_usa)

{'Omaha', 'New York', 'San Francisco', 'Little Rock', 'Dallas', 'Los Angeles', 'Chicago'}

In [79]:
# adding another city to the set
cities_in_usa.add('New Jersey')
print(cities_in_usa)

{'Omaha', 'New York', 'San Francisco', 'Little Rock', 'Dallas', 'New Jersey', 'Los Angeles', 'Chicago'}

In [80]:
# removing an element from a set
cities_in_usa.remove('Omaha')
print(cities_in_usa)

{'New York', 'San Francisco', 'Little Rock', 'Dallas', 'New Jersey', 'Los Angeles', 'Chicago'}

In [81]:
# length of the set
print(len(cities_in_usa))

7

In [ ]:
print(cities_in_usa)

In [86]:
# using List comprehension for sets
# this is more effiecient than a regular for loop
print([x  for x in cities_in_usa if x in 'Dallas' ])

['Dallas']

In [89]:
# another exmaple for list comprehension for set
print([x for x in set('ancdjcdkdlruroer') if x not in 'rac' ])

['j', 'n', 'd', 'u', 'l', 'o', 'k', 'e']

###### Tuple
1. consists of a number of values separated by commas
2. Tuples are immutable or unchangable - once defined you cannot edit,add, delete values
3. can contain duplicate values
4. Useful when you do not want anyone to manipulate the data

In [93]:
# creating a Tuple
City=("New Delhi", "Mumbai", "Chennai", "Noida")
print(City)

('New Delhi', 'Mumbai', 'Chennai', 'Noida')

In [97]:
# creating Tuple from ctor with dupliate values
city_tuple = tuple(("Paris", "Geneva", "London", "Frankfurt", "London"))
print(city_tuple)

('Paris', 'Geneva', 'London', 'Frankfurt', 'London')

In [95]:
# Accessing a value from Tuple using index which starts from 0
print(City[0])
print(City[3])

New Delhi
Noida

In [100]:
# No. of element s in a Tuple
print("City element count", len(City))
print("City Tuple element count", len(city_tuple))

City element count 4
City Tuple element count 5

###### Dictionary
1. It unordered collection
2. Can be changed 
3. Can be indexed by keys. Keys can be string or Number or Tuples containing only String, numbers
4. cannot contain duplicate values
5. A set of Key:value pair
6. Pair of empty braces creates a Dictionary like a= {}

In [2]:
# Creating dcitinary with key value Pair
State_capital ={'Arkansas':'Little Rock', 'Wisconsin':'Madison', 'California':'Sacramento', 'Iowa':'Des Moines'}
print(State_capital)

{'Arkansas': 'Little Rock', 'Wisconsin': 'Madison', 'California': 'Sacramento', 'Iowa': 'Des Moines'}

In [1]:
# creating a Dictionary
cities_in_country ={'India':['Mumbai', 'New Delhi', 'Chennai'],
                   'USA':['New York', 'San Francisco', 'Chicago', ' Los Angeles']}
print(cities_in_country)

{'India': ['Mumbai', 'New Delhi', 'Chennai'], 'USA': ['New York', 'San Francisco', 'Chicago', ' Los Angeles']}

In [4]:
# creating Dictionary using ctor
fruits = dict([('Apple','Red'), ('Mango','Yellow'), ('Strawberry','Red')])
print(fruits)

{'Apple': 'Red', 'Mango': 'Yellow', 'Strawberry': 'Red'}

In [5]:
# sorting Dcitionary
print(sorted(State_capital))

['Arkansas', 'California', 'Iowa', 'Wisconsin']

In [6]:
# finding a key  in a dictionary
print('India' in cities_in_country)
print('China' in cities_in_country)

True
False

In [7]:
# retrieving a value by using a key
print(State_capital['Iowa'])

Des Moines

In [11]:
# looping thru dictionary
for k,v in State_capital.items():
    print("State:", k," Capital: ", v)

State: Arkansas  Capital  Little Rock
State: Wisconsin  Capital  Madison
State: California  Capital  Sacramento
State: Iowa  Capital  Des Moines

In [50]:
#List comprehension
print({k:v for (k,v) in cities_in_country.items()})
print(k for k in cities_in_country.items())

{'India': ['Mumbai', 'New Delhi', 'Chennai'], 'USA': ['New York', 'San Francisco', 'Chicago', ' Los Angeles']}
<generator object <genexpr> at 0x000002308D4FC0A0>

In [34]:
#Dictionary comprehension with if condition
print({k:v for (k,v) in State_capital.items() if k == 'Arkansas'})

{'Arkansas': 'Little Rock'}

In [29]:
#Adding a key  value pair in a dictionary
State_capital.update({'Texas' : 'Dallas'})
print(State_capital)

{'Arkansas': 'Little Rock', 'Wisconsin': 'Madison', 'California': 'Sacramento', 'Iowa': 'Des Moines', 'Texas': 'Dallas'}

In [52]:
#Adding a key  value pair in a dictionary
cities_in_country['France']= ['Paris','Cannes']
print(cities_in_country)

{'India': ['Mumbai', 'New Delhi', 'Chennai'], 'USA': ['New York', 'San Francisco', 'Chicago', ' Los Angeles'], 'France': ['Paris', 'Cannes']}

In [36]:
#updating data for a key in a dictionary
State_capital['Arkansas'] ='Rogers'
print(State_capital)

{'Arkansas': 'Rogers', 'Wisconsin': 'Madison', 'California': 'Sacramento', 'Iowa': 'Des Moines', 'Texas': 'Dallas'}

In [51]:
# values in a dictionaty
print(cities_in_country.values())

dict_values([['Mumbai', 'New Delhi', 'Chennai'], ['New York', 'San Francisco', 'Chicago', ' Los Angeles']])

In [53]:
# Keys in a dictionary
print(cities_in_country.keys())

dict_keys(['India', 'USA', 'France'])

In [54]:
# deleting a key value pair from a dictionary
print(fruits)
del(fruits['Mango'])
print(fruits)

{'Apple': 'Red', 'Mango': 'Yellow', 'Strawberry': 'Red'}
{'Apple': 'Red', 'Strawberry': 'Red'}

#### Dataframe
1. Two dimensional labeled data structure with different data types
2. Dataframe consists of data, columns and index

In [62]:

from sklearn.datasets import load_iris
import numpy as np
import pandas as pd

In [75]:
# reading data into a Dataframe
# loading Flights data
data_1 = pd.read_csv("flights.csv")
data_frame1 = pd.DataFrame(data_1)
data_frame1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 4 columns):
year          74 non-null int64
month         74 non-null object
passengers    74 non-null int64
Unnamed: 3    0 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 2.4+ KB

In [76]:
# Displaying Columns in the DataFrame
data_frame1.columns

Index(['year', 'month', 'passengers', 'Unnamed: 3'], dtype='object')

In [79]:
# Removing Unnamed Column from the dataframe
data_frame1 = data_frame1.iloc[:,[0,1,2]]
data_frame1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 3 columns):
year          74 non-null int64
month         74 non-null object
passengers    74 non-null int64
dtypes: int64(2), object(1)
memory usage: 1.8+ KB

In [80]:
data_frame1.index

RangeIndex(start=0, stop=74, step=1)

In [86]:
# Print data from selected rows and columns
print(data_frame1['passengers'][70:])

70    203
71    229
72    242
73    233
Name: passengers, dtype: int64

In [88]:
# Retrieves Data from data Frame for row 3
data_frame1.iloc[2]

year           1949
month         March
passengers      132
Name: 2, dtype: object

In [94]:
# Loading data from clipboard
product= pd.read_clipboard()
product

  Product Id            Description
0       P123     Nike Running Shoes
1       P234           Dove Shampoo
2       P345  Pepsi 16OZ. Diet Coke
3       P999  Good furniture chairs
4       P567         Comfort sheets

In [95]:
brand = pd.read_clipboard()
brand

  Product Id Brand Name
0       P123       Nike
1       P234       Dove
2       P345      Pepsi
3       P700       Coke

In [100]:
# Merge two data Frame - Innner Join
prod_brand = pd.merge(product, brand, on="Product Id")
prod_brand

  Product Id            Description Brand Name
0       P123     Nike Running Shoes       Nike
1       P234           Dove Shampoo       Dove
2       P345  Pepsi 16OZ. Diet Coke      Pepsi

In [102]:
# Merge two data Frame - Left Outer Join
prod_brand_left = pd.merge(product, brand, on="Product Id", how="left")
prod_brand_left

  Product Id            Description Brand Name
0       P123     Nike Running Shoes       Nike
1       P234           Dove Shampoo       Dove
2       P345  Pepsi 16OZ. Diet Coke      Pepsi
3       P999  Good furniture chairs        NaN
4       P567         Comfort sheets        NaN

In [103]:
# Merge two data Frame - Right Outer Join
prod_brand_right = pd.merge(product, brand, on="Product Id", how="right")
prod_brand_right

  Product Id            Description Brand Name
0       P123     Nike Running Shoes       Nike
1       P234           Dove Shampoo       Dove
2       P345  Pepsi 16OZ. Diet Coke      Pepsi
3       P700                    NaN       Coke

In [112]:
# finding how many columns have null values
#step by step
print(prod_brand_left.isnull())  # check if there are  Null values
print(prod_brand_left.isnull().values.ravel()) # returns a continous flattened Array
print(prod_brand_left.isnull().values.ravel().sum())

   Product Id  Description  Brand Name
0       False        False       False
1       False        False       False
2       False        False       False
3       False        False        True
4       False        False        True
[False False False False False False False False False False False  True
 False False  True]
2

In [118]:
# Join can be used instaed of Merge specify rsuffix and lsuffix to specify the key
df_join = product.join(brand, rsuffix="_Product", lsuffix="_Product")
df_join

  Product Id_Product            Description Product Id_Product Brand Name
0               P123     Nike Running Shoes               P123       Nike
1               P234           Dove Shampoo               P234       Dove
2               P345  Pepsi 16OZ. Diet Coke               P345      Pepsi
3               P999  Good furniture chairs               P700       Coke
4               P567         Comfort sheets                NaN        NaN

In [120]:
# using concat to combine two dataframes
df_concat = pd.concat([product, brand])
df_concat

  Brand Name            Description Product Id
0        NaN     Nike Running Shoes       P123
1        NaN           Dove Shampoo       P234
2        NaN  Pepsi 16OZ. Diet Coke       P345
3        NaN  Good furniture chairs       P999
4        NaN         Comfort sheets       P567
0       Nike                    NaN       P123
1       Dove                    NaN       P234
2      Pepsi                    NaN       P345
3       Coke                    NaN       P700

In [123]:
# uerying data from dataframe based on conditions
product[product["Product Id"] =="P123"]

  Product Id         Description
0       P123  Nike Running Shoes

In [131]:
#Reading the data from a csv file 
flights_data = pd.read_csv('flights.csv')
flights_data = flights_data.loc[:,["year", "month", "passengers"]]
flights_data

    year      month  passengers
0   1949    January         112
1   1949   February         118
2   1949      March         132
3   1949      April         129
4   1949        May         121
5   1949       June         135
6   1949       July         148
7   1949     August         148
8   1949  September         136
9   1949    October         119
10  1949   November         104
11  1949   December         118
12  1950    January         115
13  1950   February         126
14  1950      March         141
15  1950      April         135
16  1950        May         125
17  1950       June         149
18  1950       July         170
19  1950     August         170
20  1950  September         158
21  1950    October         133
22  1950   November         114
23  1950   December         140
24  1951    January         145
25  1951   February         150
26  1951      March         178
27  1951      April         163
28  1951        May         172
29  1951       June         178
..   ...        ...         ...
44  1952  September         209
45  1952    October         191
46  1952   November         172
47  1952   December         194
48  1953    January         196
49  1953   February         196
50  1953      March         236
51  1953      April         235
52  1953        May         229
53  1953       June         243
54  1953       July         264
55  1953     August         272
56  1953  September         237
57  1953    October         211
58  1953   November         180
59  1953   December         201
60  1954    January         204
61  1954   February         188
62  1954      March         235
63  1954      April         227
64  1954        May         234
65  1954       June         264
66  1954       July         302
67  1954     August         293
68  1954  September         259
69  1954    October         229
70  1954   November         203
71  1954   December         229
72  1955    January         242
73  1955   February         233

[74 rows x 3 columns]

In [139]:
# Grouping data and mean by year
df_yearly_mean= flights_data.groupby(["year"]).mean()
df_yearly_mean

      passengers
year
1949  126.666667
1950  139.666667
1951  170.166667
1952  197.000000
1953  225.000000
1954  238.916667
1955  237.500000

In [140]:
# Grouping data and summing by year to know  how many passengers travelled each Year and followed by month
df_yearly_sum= flights_data.groupby(["year", "month"]).sum()
df_yearly_sum

                passengers
year month
1949 April             129
     August            148
     December          118
     February          118
     January           112
     July              148
     June              135
     March             132
     May               121
     November          104
     October           119
     September         136
1950 April             135
     August            170
     December          140
     February          126
     January           115
     July              170
     June              149
     March             141
     May               125
     November          114
     October           133
     September         158
1951 April             163
     August            199
     December          166
     February          150
     January           145
     July              199
...                    ...
1952 May               183
     November          172
     October           191
     September         209
1953 April             235
     August            272
     December          201
     February          196
     January           196
     July              264
     June              243
     March             236
     May               229
     November          180
     October           211
     September         237
1954 April             227
     August            293
     December          229
     February          188
     January           204
     July              302
     June              264
     March             235
     May               234
     November          203
     October           229
     September         259
1955 February          233
     January           242

[74 rows x 1 columns]

In [143]:
df_yearly_sum.columns

Index(['passengers'], dtype='object')

In [148]:
#find months and yearls where more than 300 passengers travlled

df_300 = df_yearly_sum[df_yearly_sum["passengers"] >300]
df_300

            passengers
year month
1954 July          302

In [150]:
df_300.transpose()

year       1954
month      July
passengers  302

In [157]:
# pivot the data by Year, have month and columns and show passengers count as values
flights_data.pivot(columns="month", values="passengers", index="year")

month,April,August,December,February,January,July,June,March,May,November,October,September
year,,,,,,,,,,,,
1949,129.0,148.0,118.0,118.0,112.0,148.0,135.0,132.0,121.0,104.0,119.0,136.0
1950,135.0,170.0,140.0,126.0,115.0,170.0,149.0,141.0,125.0,114.0,133.0,158.0
1951,163.0,199.0,166.0,150.0,145.0,199.0,178.0,178.0,172.0,146.0,162.0,184.0
1952,181.0,242.0,194.0,180.0,171.0,230.0,218.0,193.0,183.0,172.0,191.0,209.0
1953,235.0,272.0,201.0,196.0,196.0,264.0,243.0,236.0,229.0,180.0,211.0,237.0
1954,227.0,293.0,229.0,188.0,204.0,302.0,264.0,235.0,234.0,203.0,229.0,259.0
1955,NaN,NaN,NaN,233.0,242.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [162]:
# pivot the data by Year, have month and columns and show passengers count as values
flights_data.pivot( values="passengers", index="month", columns ="year")

year        1949   1950   1951   1952   1953   1954   1955
month
April      129.0  135.0  163.0  181.0  235.0  227.0    NaN
August     148.0  170.0  199.0  242.0  272.0  293.0    NaN
December   118.0  140.0  166.0  194.0  201.0  229.0    NaN
February   118.0  126.0  150.0  180.0  196.0  188.0  233.0
January    112.0  115.0  145.0  171.0  196.0  204.0  242.0
July       148.0  170.0  199.0  230.0  264.0  302.0    NaN
June       135.0  149.0  178.0  218.0  243.0  264.0    NaN
March      132.0  141.0  178.0  193.0  236.0  235.0    NaN
May        121.0  125.0  172.0  183.0  229.0  234.0    NaN
November   104.0  114.0  146.0  172.0  180.0  203.0    NaN
October    119.0  133.0  162.0  191.0  211.0  229.0    NaN
September  136.0  158.0  184.0  209.0  237.0  259.0    NaN